app/Controllers/Auth.php

                if ($this->validation->run($verif_data, 'register') == FALSE) {
                    $this->data['errorRes'] = $this->validation->getErrors();
                } else {
                    $userCount = $this->userTable->where('email', $verif_data['emailReg'])->select('email')->findAll();

                    if (count($userCount) == 0) {
                        $this->userTable->insert(['email' => $verif_data['emailReg'], 'password' => $verif_data['passwordReg'], 'status' => 'enable']);
                        $this->userDetailTable->insert(['name' => $verif_data['name'], 'gender' => $verif_data['gender'], 'birthdate' => $verif_data['birthdate'], 'phone' => $verif_data['phone'], 'address' => $verif_data['address'], 'email' => $verif_data['emailReg'], 'fine' => 0]);
---
SELECT `email`
FROM `user`
WHERE `email` = 'oscar32@gmail.com'
INSERT INTO `user` (`email`, `password`, `status`) VALUES ('oscar10@gmail.com', 'dono3232', 'enable')
INSERT INTO `user_detail` (`name`, `gender`, `birthdate`, `phone`, `address`, `email`, `fine`) VALUES ('fdsfsd', 'M', '1122-02-23', '088129320234', 'rwerwrwerw', 'oscar32@gmail.com', 0)