app/Controllers/Index.php

SELECT *
FROM `book`
ORDER BY `title` ASC
SELECT `name`
FROM `book_author`
JOIN `author` ON `book_author`.`author_id` = `author`.`id`
WHERE `book_author`.`book_id` = 1
SELECT `publisher`.`name`
FROM `book`
JOIN `publisher` ON `book`.`publisher_id` = `publisher`.`id`
WHERE `book`.`id` = 1
---
    public function showpage()
    {
        $books = $this->bookTable->orderBy('title', 'ASC')->findAll();
        $data['bookData'] = $books;
        for ($i = 0; $i < count($data['bookData']); $i++) {
            $author = $this->bookAuthorTable->select('name')->join('author', 'book_author.author_id = author.id')->where('book_author.book_id = ' . $data['bookData'][$i]['id'])->find();

            $data['bookData'][$i]['author'] = $author;

            $publisher = $this->bookTable->select('publisher.name')->join('publisher', 'book.publisher_id = publisher.id')->where('book.id = ' . $data['bookData'][$i]['id'])->find();